Revit 2027 API
PipeFittingAndAccessoryPressureDropData.GetPipeFittingAndAccessoryData Method
 Returns the fitting and accessory information
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
Public Function GetPipeFittingAndAccessoryData As PipeFittingAndAccessoryData
public:
PipeFittingAndAccessoryData^ GetPipeFittingAndAccessoryData()
member GetPipeFittingAndAccessoryData : unit -> PipeFittingAndAccessoryData
Return Value
PipeFittingAndAccessoryData
See Also
Reference
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace